Fuentes/ficohsacore-osb-7e5cceccb837/Middleware/v2/Resources/ActivacionTarjetaDebito/wsdl/activacionTarjetaDebitoPS.wsdl

<wsdl:definitions name="activacionTarjetaDebitoPS" targetNamespace="http://www.ficohsa.com.hn/middleware.services/activacionTarjetaDebitoPS/" xmlns:fic="http://www.ficohsa.com.hn/middleware.services/activacionTarjetaDebitoPS/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:cons="http://www.ficohsa.com.hn/middleware.services/activacionTarjetaDebitoTypes">

	<wsdl:types>
		<xsd:schema>
			<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autType" schemaLocation="../../esquemas_generales/HeaderElements.xsd"/>
		</xsd:schema>
		<xsd:schema>
			<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/activacionTarjetaDebitoTypes" schemaLocation="../xsd/activacionTarjetaDebitoTypes.xsd"/>
		</xsd:schema>
	</wsdl:types>

	<wsdl:message name="activacionTarjetaDebitoRequest">
		<wsdl:part element="cons:activacionTarjetaDebito" name="parameters"/>
		<wsdl:part name="RequestHeader" element="auth:RequestHeader"/>
	</wsdl:message>
	<wsdl:message name="activacionTarjetaDebitoResponse">
		<wsdl:part element="cons:activacionTarjetaDebitoResponse" name="result"/>
		<wsdl:part name="ResponseHeader" element="auth:ResponseHeader"/>
	</wsdl:message>

	<wsdl:portType name="activacionTarjetaDebitoPS">
		<wsdl:operation name="activacionTarjetaDebito" parameterOrder="parameters RequestHeader ResponseHeader">
			<wsdl:input message="fic:activacionTarjetaDebitoRequest"/>
			<wsdl:output message="fic:activacionTarjetaDebitoResponse"/>
		</wsdl:operation>
	</wsdl:portType>

	<wsdl:binding name="activacionTarjetaDebitoPSSOAP" type="fic:activacionTarjetaDebitoPS">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="activacionTarjetaDebito">
			<soap:operation soapAction="http://www.ficohsa.com.hn/middleware.services/activacionTarjetaDebitoPS/activacionTarjetaDebito"/>
			<wsdl:input>
				<soap:body use="literal" parts="parameters"/>
				<soap:header message="fic:activacionTarjetaDebitoRequest" part="RequestHeader" use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" parts="result"/>
				<soap:header message="fic:activacionTarjetaDebitoResponse" part="ResponseHeader" use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>

	<wsdl:service name="activacionTarjetaDebitoPS">
		<wsdl:port binding="fic:activacionTarjetaDebitoPSSOAP" name="activacionTarjetaDebitoPSSOAP">
			<soap:address location="http://10.9.104.32:8003/Middleware/OperationsAndExecution/Cards/activacionTarjetaDebito"/>
		</wsdl:port>
	</wsdl:service>

</wsdl:definitions>